# config

publishedAfter = "2023-01-01T09:00:00+09:00"
publishedBefore = "2026-01-01T08:59:59+09:00"
order = "viewCount"  # date, rating, relevance, title, videoCount, viewCount
total_count = 100

# ===== 지역 그룹 =====
LOCATION_GROUPS = { # 최대 50개 한번에 호출 가능
    "성수동": ["성수동", "성수", "서울숲"],
    "가산동": ["가산", "가산디지털단지", "가디역"],
    "서교동": ["홍대", "서교동", "홍대입구역", "합정"],
    "여의동": ["여의도", "더현대서울", "IFC몰"],
    "압구정동": ["압구정", "압구정로데오", "도산공원", "압구정역"],
    "상암동": ["상암", "상암동", "DMC"],
    "효창동": ["효창공원", "효창공원앞역", "효창동"],
    "삼성1동(삼성역)": ["코엑스", "삼성역", "봉은사역"],
    "삼성2동(선정릉)": ["선정릉", "선정릉역", "강남구청역"],
    "대치4동": ["선릉역", "한티역", "대치동"],
    "구로3동": ["구로디지털단지", "구디", "남구로역"],
    "서초2동": ["강남역", "양재역", "뱅뱅사거리"],
    "신당동": ["신당동", "힙당동", "신당역"],
    "용강동(마포)": ["마포역", "용강동", "마포"],
    #  ---
    # "문정2동": ["문정법조단지", "문정역", "가락시장", "장지역"],
    # "논현2동": ["언주역", "학동역", "강남구청역"],
    # "청담동": ["청담", "청담동", "청담역"],
    # "금호1가동": ["금호동", "금호역", "신금호역"],
    # "염리동": ["공덕역", "대흥역", "경의선숲길"],
    # "송파2동": ["송파역", "송파동", "석촌역"],
    # "양평2동": ["당산역", "선유도역", "선유도"],
    # "서초3동": ["서초역", "예술의전당", "남부터미널역"],
    # "방배1동": ["방배역", "내방역", "방배동"],
    # "중림동": ["충정로역", "중림동", "서울로7017"],
}
# 자동 키워드 생성
# 지역 설정

LOCATIONS = []
for keywords in LOCATION_GROUPS.values():
    LOCATIONS.extend(keywords)

# 중복 제거
LOCATIONS = list(set(LOCATIONS))

# 카테고리 설정
CATEGORIES = [
    "카페", 
    "맛집",
    "핫플",
    "팝업",
    "브이로그"
]

# OR 연산자로 통합된 키워드 자동 생성
KEYWORDS = [
    f"{loc} {' | '.join(CATEGORIES)}" 
    for loc in LOCATIONS
]

# API 쿼리 필터링
API_EXCLUDES = "-부동산 -매매"

# 파이썬 코드 필터링
STOPWORDS = [ 
    '부동산', '빌딩', '투자', '건물주', '매매', '시세', '분양', '상가', '주상복합', '수익', 
    '임대', '부자', '경제', '재테크', '공인중개사', '성형', '병원', '뉴스', '보도', '사건', '속보'
]

# ==== 추가 필터링 설정 ==== 
CHANNEL_BLACKLIST = ["청담언니"]  # 제외할 채널 목록
REQUIRED_IN_TITLE = ["청담", "청담동", "청담역"]  # 제목에 반드시 포함되어야 할 키워드
MIN_DURATION = 120  # 최소 영상 길이 (초) - 2분
FILTER_SHORTS = False  # Shorts 제거 여부
FILTER_ADS = False  # 협찬 콘텐츠 제거 여부
AD_KEYWORDS = ['협찬', '#협찬', 'AD', '광고', 'PR', '제공', 'sponsor']  # 협찬 키워드
